Repository: lilyrae/stephanie-va
Catalog: Stephanie/locales/*/LC_MESSAGES/messages.po
Languages: it

# error.update.failed_request
source: Couldn't access stephanie's version update information.
it: Impossibile accedere alle informazioni sull'aggiornamento della versione di stephanie.

# update.old_version
source: Your virtual assistant's version is {0}, while the latest one is {1}
it: La versione dell'assistente virtuale è {0}, mentre l'ultima è {1}

# update.url
source: Kindly visit the main website of stephanie at www.github.com/slapbot/stephanie-va to update the software to it's latest version.
it: Gentilmente, visita il sito Web principale di stephanie all'indirizzo www.github.com/slapbot/stephanie-va per aggiornare il software alla sua ultima versione.

# error.update.failed_process
source: There's some problem in recieving version update information.
it: C'è qualche problema nel ricevere informazioni sull'aggiornamento della versione.

# command.ask
source: Give me your command!
it: Dammi il tuo comando!

# command.processing
source: Processing command...
it: Comando di elaborazione ...

# command.ask_repeat
source: I beg your pardon, could you repeat your command once again?
it: Chiedo scusa, potresti ripetere il comando ancora una volta?

# audio.repeat_input
source: {0} thinks you said
it: {0} pensa che tu abbia detto

# error.audio.failed_understand
source: {0} could not understand audio
it: {0} non ha potuto capire l'audio

# error.audio.failed_request_service
source: Could not request results from {0} service; {1}
it: Impossibile richiedere risultati dal servizio {0}; {1}

# error.audio.google_recognition.failed_understand
source: Google Recognition couldn't understand your audio with enough confidence.
it: Google Recognition non ha potuto capire il tuo audio con sufficiente sicurezza.

# error.missing_api_key
source: Api key not found in the config.ini file.
it: Chiave Api non trovata nel file config.ini.

# error.format_modules_file
source: Modules.json file has been not formatted correctly. check the support tab in case you're integrating some 3rd party module.
it: Il file Modules.json non è stato formattato correttamente, controlla la scheda di supporto incaso che stai integrando qualche modulo di terze parti.

# error.facebook.access.birthdays
source: I have not been authorized to query your Facebook. If you would like to check birthdays in the future, please visit the Jasper dashboard.
it: Non sono autorizzato a interrogare il tuo Facebook. Se desidericontrolla i compleanni in futuro, visita la dashboard di Jasper.

# error.service.unknown
source: I apologize, there's a problem with that service at the moment.
it: Mi scuso, c'è un problema con quel servizio al momento.

# birthday.friend.today
source: {0} has a birthday today.
it: {0} ha un compleanno oggi.

# birthday.friends.today
source: Your friends with birthdays today are
it: I tuoi amici con i compleanni oggi sono

# join.and
source: and
it: e

# birthday.none.today
source: None of your friends have birthdays today.
it: Nessuno dei tuoi amici ha un compleanno oggi.

# error.facebook.access.notifications
source: I have not been authorized to query your Facebook. If you would like to check your notifications in the future, please visit the Stephanie facebook module configuraton.
it: Non sono autorizzato a interrogare il tuo Facebook. Se desidericontrolla le tue notifiche in futuro, visita la Stephanie facebookconfigurazione del modulo.

# facebook.notifications.none
source: You have no Facebook notifications.
it: Non hai notifiche di Facebook.

# facebook.notifications
source: You have {0} Facebook notifications.
it: Hai {0} notifiche di Facebook.

# error.gmail.access
source: Either your credentials are wrong mate, or there is some problem going on, do me a favor, I know you won't but whatever, just inform me in the forums.
it: O le tue credenziali sono accoppiamenti sbagliati, o c'è qualche problema in corsoFammi un favore, so che non lo farai ma qualunque cosa, solo informami nei forum.

# gmail.unread.latest
source: You have {0} unread emails, out of which 5 latest ones are as follows, please wait a second, as I process
it: Hai {0} email non lette, di cui le ultime 5 sono le seguenti,per favore aspetta un secondo, mentre elaboro

# error.gmail.authentication
source: I'm sorry. I'm not authenticated to work with your Gmail.
it: Mi dispiace, non sono autenticato per lavorare con Gmail.

# gmail.unread.none
source: You have no unread emails.
it: Non hai email non lette.

# gmail.unread.one
source: You have one unread email from {0}.
it: Hai un'email non letta da {0}.

# gmail.unread
source: You have {0} unread emails
it: Hai {0} email non lette

# gmail.senders
source: . Senders include:
it: . I mittenti includono::

# join.from
source: from
it: a partire dal

# error.news.configuration
source: Kindly look back at the documentation to configure news module properly especially the API keys.
it: Si prega di consultare la documentazione per configurare correttamente il modulo di notizieSoprattutto le chiavi API.

# news.category.ask
source: Would you prefer any specific category? If yes then what would it be?
it: Preferiresti una categoria specifica? Se sì, allora quale sarebbe?

# news.sources.ask
source: Do you have any preference for the source of your news? like CNNor Time magazine or maybe The hindu?
it: Hai qualche preferenza per la fonte delle tue notizie? Come CNNorTime magazine o forse The indù?

# news.sources.list
source: Out of all the sources as follows
it: Tra tutte le fonti come segue

# news.sources.select
source: , which one would you like to pick?
it: , quale ti piacerebbe scegliere?

# news.sources.all.ask
source: Do you want me to list all the sources? There are around 70 so it may takea while. Or you can let me know of your preferred source name and I would let you know if it's available or not.
it: Vuoi che elenchi tutte le fonti? Ci sono circa 70 quindi potrebbe volerciun po 'o puoi farmi sapere il tuo nome sorgente preferitoe ti farei sapere se è disponibile o meno.

# news.sources.all
source: No problem, here are all the available sources as follows
it: Nessun problema, qui ci sono tutte le fonti disponibili come segue

# news.sort.two_options
source: And what kind of news sort would you like? {0} or {1}?
it: E che tipo di notizie vorresti? {0} o {1}?

# news.sort.three_options
source: And what kind of news sort would you like? {0} or {1}, or maybe {2}?
it: E che tipo di notizie vorresti? {0} o {1}, o forse {2}?

# news.sort.described_options
source: And what kind of news sort would you like? The latest or maybe top ones shown in front page?
it: E che tipo di notizie vorresti? Le ultime o forse le migliori inprima pagina?

# news.report
source: So the {0} news from {1} news source are as follows
it: Quindi le {0} notizie dalla {1} fonte di notizie sono le seguenti

# news.report.by
source: was reported by {0}.
it: è stato segnalato da {0}.

# news.report.continue
source: and in the other news.
it: e nelle altre notizie.

# calendar.add.successful
source: Okay, I added it to your calendar
it: Ok, l'ho aggiunto al tuo calendario

# calendar.events.today.none
source: You have no events scheduled for today
it: Non ci sono eventi in programma per oggi

# calendar.events.tomorrow.none
source: You have no events scheduled for tomorrow
it: Non ci sono eventi in programma per domani

# complete
source: That's it.
it: Questo è tutto.

# rephrase.ask
source: Can you possibly phrase it a bit better?
it: Puoi forse esprimerlo un po 'meglio?

# error.search.no_results
source: Sorry, I couldn't find what you asked for, maybe try being a little more specific.
it: Scusa, non sono riuscito a trovare quello che hai chiesto, magari provare ad essere un po 'piùspecifica.

# error.search.wolframalpha
source: It seems something is wrong with the wolframalpha search engine, maybe try asking later.
it: Sembra che ci sia qualcosa di sbagliato nel motore di ricerca wolframalpha, magari provarechiedendo dopo.

# error.search.no_api_token
source: Seems you haven't provided the API TOKEN for search engine, please add it in config file.
it: Sembra che tu non abbia fornito l'API TOKEN per il motore di ricerca, per favore aggiungilo infile di configurazione.

# error.search.wolframalpha.no_api_token
source: API TOKEN for wolframalpha search engine is missing, head in to docs to see how to properly fill the configurations for search engine.
it: Manca API TOKEN per il motore di ricerca wolframalpha, visita i documenti per vederecome compilare correttamente le configurazioni per il motore di ricerca.

# error.search.incorrect_api_token
source: Seems you haven't provided the API TOKEN or it's wrong for search engine, please add it in config file.
it: Sembra che tu non abbia fornito l'API TOKEN o che sia sbagliato per il motore di ricercaper favore aggiungilo nel file di configurazione.

# error.search.wolframalpha.incorrect_api_token
source: API TOKEN for wolframalpha search engine is missing or is invalid, head in to docs to see how to properly fill the configurations for search engine.
it: API TOKEN per il motore di ricerca wolframalpha manca o non è valido, vai avantia documenti per vedere come riempire correttamente le configurazioni per il motore di ricerca.

# error.note.create
source: Note wasn't created successfully. There may have been a spelling error... Pleaserefer back to the docs.
it: La nota non è stata creata correttamente. Potrebbe essersi verificato un errore di ortografia ... Per favorerimandi ai documenti.

# note.create.success
source: I successfully wrote down your note.
it: Ho scritto con successo il tuo messaggio.

# movie.ask_confirmation
source: Is the movie you're referring to {0}, released in {1}
it: Il film ti stai riferendo a {0}, pubblicato in {1}

# movie.suggest
source: Alright, then how about {0}, released in {1}
it: Va bene, allora che ne dici di {0}, rilasciato in {1}

# movie.moody
source: Alright dude, you are kind of moody.
it: Va bene amico, sei un po 'lunatico.

source: found
it: trovato

# movie.ask_repeat
source: Sorry, but your pronounciation is awful. Try again
it: Scusa, ma la tua pronuncia è orribile. Prova ancora

# movie.report
source: {0} was released in {1}, directed by {2} of genre {3} has a runtime of about {4} garnered a rating of {5} featuring {6} had a plot such as {7}
it: {0} è stato rilasciato in {1}, diretto da {2} di genere {3} ha un runtime di circa{4} ha ottenuto una valutazione di {5} con {6} ha avuto una trama come {7}

# life.meaning
source: 42 is the meaning of life.
it: 42 è il significato della vita.

# greeting.sir
source: {0}, sir!
it: {0}, signore!

# greeting.mam
source: {0}, mam!
it: {0}, mamma!

# greeting.dear
source: {0}, dear!
it: {0}, caro!

# system.sleep
source: Sleep for the weak!
it: Dormire è per i deboli!

# system.quit
source: I will come back stronger!
it: Tornerò più forte!

# system.version
source: I am currently running on {0} version {1}.
it: Attualmente sto girando su {0} versione {1}.

# system.name
source: This system is named {0} and has {1} CPU cores.
it: Questo sistema è chiamato {0} e ha {1} core della CPU.

# system.disk_percent
source: Current disk_percent is {0} percent.
it: L'attuale spesa del disco è {0} percento.

# system.cpu
source: Current CPU utilization is {0} percent.
it: L'utilizzo attuale della CPU è {0} percento.

# system.memory
source: Current memory utilization is {0} percent.
it: L'utilizzo della memoria corrente è {0} percento.

# system.running_since
source: it's running since {0}.
it: è in esecuzione dal {0}.

# time.now
source: The time is {0} {1} {2}
it: Il tempo è {0} {1} {2}

# greeting.morning
source: Good Morning
it: Buongiorno

# greeting.afternoon
source: Good Afternoon
it: Buon pomeriggio

# greeting.evening
source: Good Evening
it: Buona serata

# error.zomato.missing_info
source: Your api key wasn't provided or maybe your city isn't available.
it: La tua chiave APi non è stata fornita o forse la tua città non è disponibile.

# restaurant.recommendation.none
source: No good places to eat found nearby your location.
it: Nessun buon posto dove mangiare trovato nelle vicinanze della tua posizione.

# restaurant.recommendation
source: {0} situated nearby {1} is found, it offers cuisines like {2} with an average price range of {3} {4} per person, and over {5} people haverated this place with an average ratings as{6}. So would you like to order this place?
it: {0} situato nelle vicinanze {1} è trovato, offre cucine come {2} con unfascia di prezzo medio di {3} {4} a persona e oltre {5} persone haveratoquesto posto con una valutazione media come {6}. Quindi ti piacerebbe ordinare questoposto?

# thanks
source: Thank you.
it: Grazie.

# restaurant.recommendation.alternative
source: okay, then how about this one?
it: okay, allora che ne dici di questo?

# restaurant.recommendation.complete
source: That's all the restaurants available near your location.
it: Sono tutti ristoranti disponibili vicino alla tua posizione.

# twitter.trends.top
source: these were the top 5 trends on twitter globally.
it: Queste sono state le prime 5 tendenze su twitter a livello globale.

# twitter.tweet.ask
source: What would you like to tweet?
it: Cosa ti piacerebbe twittare?

# twitter.tweet.successful
source: {0} has been tweeted
it: {0} è stato twittato

# twitter.retweets
source: Latest Retweets are
it: Gli ultimi retweet sono

# join.by
source: by
it: di

# twitter.retweets.none
source: You have no re-tweets.
it: Non hai re-tweets.

# twitter.mentions.latest
source: Latest Mentions are
it: Le ultime menzioni sono

# twitter.mentions.none
source: You have no mentions.
it: Non hai menzioni.

# twitter.notifications.latest
source: These were the latest notifications.
it: Queste erano le ultime notifiche.

# alright.blimey
source: Alright then blimey.
it: Va bene, allora, bliney.

# weather.today
source: Weather at {0}. Today is {1}. There is a chance of {2}. Now Temperature is {3} degree {4}. Humidity {5} percent. Wind Speed {6} with cloud cover {7} percent.
it: Meteo a {0}. Oggi è {1}. C'è una possibilità di {2}. Ora la temperatura è{3} degree {4}. Umidità {5} percento Velocità del vento {6} con copertura nuvolosa {7}per cento.

# weather.tomorrow
source: Weather at {0}. Tomorrow will be {1}. There will be a chance of {2}. Temperature in the morning {3} degree {4}. Days Temperature will be {5} degree {4}. and Temperature at night will be {6} degree {4}. Humidity {7} percent. Wind Speed {8} with clouds cover {9} percent.
it: Meteo a {0}. Domani sarà {1}. Ci sarà la possibilità di {2}.Temperatura al mattino {3} laurea {4}. La temperatura dei giorni sarà {5}grado {4} e temperatura di notte sarà {6} grado {4}. Umidità {7}Percentuale: velocità del vento {8} con copertura delle nuvole {9} percento.

# weather.next_week
source: Weather forecast for next week at {0}.
it: Previsioni del tempo per la prossima settimana a {0}.

# weather.rain.days
source: Rainy Days are
it: I giorni di pioggia sono

# weather.rain.most
source: You will observe heavy rain on
it: Osserverai la pioggia battente su

# weather.sun.days
source: Sunny Days are
it: I giorni di sole sono

# weather.sun.most
source: You will feel heat on
it: Sentirai calore

# weather.wind.day
source: Most windy day will be
it: La giornata più ventosa sarà

# weather.humid.day
source: Most humid day will be
it: Il giorno più umido sarà

# weather.cold.day
source: Coolest day will be
it: La giornata più bella sarà

# encyclopedia.search.ask
source: What would you like to know about?
it: Cosa ti piacerebbe sapere?

# encyclopedia.search.no_results
source: Sorry, I couldn't find any article with that title. :sadface:
it: Scusa, non ho trovato nessun articolo con quel titolo. :sadface:

# error.encyclopedia.search
source: Unable to search your given query.
it: Impossibile cercare la query fornita.

# error.no_api_keys
source: API keys for {0} were not provided in the config.ini file. Please refer back to the docs.
it: Le chiavi API per {0} non sono state fornite nel file config.ini. Fai riferimento ai documenti.

# error.incorrect_api_keys
source: The API key was incorrect or wasn't provided at all for {0}. Please refer back to the docs.
it: La chiave API non era corretta o non è stata fornita affatto per {0}. Fai riferimento ai documenti.

# error.speaker.default
source: Default Audio Player for mp3 files is not set up, like vlc or something.
it: Default Audio Player per file mp3 non è impostato, come vlc o qualcosa del genere.

# error.eyed3_package.unknown
source: Seems like eyed3 named package wasn't installed probably Check back at the support tab in the main website. Or if you're trying to close the application abruptly, keep pressing CTRL + C repeatedly.
it: Sembra che il pacchetto con nome eyed3 non sia stato installato probabilmente Controlla indietro alscheda di supporto nel sito Web principale o se stai cercando di chiudere ilImprovvisamente, continua a premere CTRL + C ripetutamente.

# error.google_text.unknown
source: Some issue with google text to speech mechanism, change to some other service. Or you can wait and try turning it off and on again.
it: Qualche problema con il meccanismo di sintesi vocale di google, passa ad un altroservizio, oppure puoi aspettare e provare a spegnerlo e riaccenderlo.

# error.google_text.save
source: Look it shouldn't happen but since it happened, just get to support tab of main website mate, some issue with os is what I assume unless you haven't changed code if in that caseman, well.
it: Guarda che non dovrebbe succedere ma da quando è successo, vai nella scheda di supporto dicompagno di sito principale, qualche problema con os è quello che presumo a meno che tu non abbiaha cambiato codice se in quel caseman, beh.

# virtual_assistant.sleep
source: The virtual assistant is going to sleep by {0} method
it: L'assistente virtuale sta andando a dormire con il metodo {0}

# virtual_assistant.quit
source: The virtual assistant is being quit by {0} method
it: L'assistente virtuale viene chiuso con il metodo {0}

# modules.init.start
source: Modules are being initialised...
it: I moduli vengono inizializzati...

# modules.init.complete
source: Modules were initialised.
it: I moduli sono stati inizializzati.

# stephanie.ready
source: Stephanie is on and loading, wait for the beep sound to give your command.
it: Stephanie è acceso e in fase di caricamento, aspetta che venga emesso il segnale acustico.
